# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В этом модуле нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем делать в текущем модуле. Представьте, что движок игры могут использовать
# разные клиенты - веб, чатбот, приложение, етс - они знают как спрашивать и отвечать пользователю.
# Движок игры реализует только саму функциональность игры.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT
from termcolor import cprint
from mastermind_engine import initial_of_number, check_of_number, user_input_check, size_of_number, initiated_number


def user_input():
    while True:
        print("Введите ", size_of_number, "-значное число: ", sep="")
        user_number = user_input_check(input())
        if user_number is None:
            cprint("Введите корректное значение!", color='red')
        else:
            break
    return user_number


initial_of_number()
counter = 0

while True:
    counter += 1
    bulls, cows = check_of_number(user_input(), counter)
    bulls_cows = {'Быки': bulls}, {'Коровы': cows}

    cprint(bulls_cows[0], color='yellow')
    cprint(bulls_cows[1], color='yellow')

    if bulls == size_of_number:
        cprint("Вы победили!", color='green')
        print("Это заняло", counter, "ходов, желаете сыграть ещё игру? y/n: ")
        asking = input()
        if asking == "y":
            initiated_number.clear()
            initial_of_number()
            counter = 0
        else:
            break
